partitioned-backwards-facing-step/fluid2/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid2;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid2-Mesh;
    patches           (cplInlet);
    
    readData
    (
      Velocity
      PressureBack
      VelocityGradientBack
    );
    
    writeData
    (
      Pressure
      VelocityBack
      VelocityGradient
    );
  };
};